Autodesk.Revit.DB.GeometryAugmentationRegistry.ValidateExternalGeometryIdMovable(Autodesk.Revit.DB.Element,System.Guid,Autodesk.Revit.DB.ExternalGeometryId)
Checks if an external geometry Id associated with the element is movable.
targetElement:
The target element.
drawingServerGUID:
Geometry server GUID.
externalGeometryId:
The External Geometry Id.
Returns:
True if an external geometry Id is associated with the element is movable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.GeometryAugmentationRegistry.ValidateExternalGeometryIdExistance(Autodesk.Revit.DB.Element,System.Guid,Autodesk.Revit.DB.ExternalGeometryId)
Checks if an external geometry Id is associated with the element.
targetElement:
The target element.
drawingServerGUID:
Geometry server GUID.
externalGeometryId:
The External Geometry Id.
Returns:
True if an external geometry Id is associated with the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.GeometryAugmentationRegistry.ResetAugmentedGeometryCoordinateSystem(Autodesk.Revit.DB.Element,System.Guid)
Resets the coordinate system in which the augmented geometry are stored relative to. This function does not change the current offset values.
targetElement:
The target element where the transforms are attached to.
drawingServerGUID:
Geometry server GUID.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element does not have a geometry augmentation server attached.
Since:
2024

Autodesk.Revit.DB.GeometryAugmentationRegistry.GetAugmentedGeometryCoordinateSystem(Autodesk.Revit.DB.Element,System.Guid)
Gets the coordinate system in which the augmented geometry are stored relative to.
targetElement:
The target element where the transforms are attached to.
drawingServerGUID:
Geometry server GUID.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element does not have a geometry augmentation server attached.
Since:
2024

Autodesk.Revit.DB.GeometryAugmentationRegistry.SetAugmentedGeometryCoordinateSystem(Autodesk.Revit.DB.Element,System.Guid,Autodesk.Revit.DB.Transform)
Sets the transformations of the movable external geometry Ids to new values.
targetElement:
The target element where the transforms are attached to.
drawingServerGUID:
Geometry server GUID.
coordinateSystemTransform:
The transform that represents the coordinate system
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element does not have a geometry augmentation server attached.
Since:
2024

Autodesk.Revit.DB.GeometryAugmentationRegistry.HasMovedGeometry(Autodesk.Revit.DB.Element,System.Guid)
Returns true if the element has geometry that was moved associated with this server.
targetElement:
The target element where the transforms are attached to.
drawingServerGUID:
Geometry server GUID.
Returns:
True if the element has geometry that was moved associated with this server. False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element does not have a geometry augmentation server attached.
Since:
2024

Autodesk.Revit.DB.GeometryAugmentationRegistry.ResetAllAugmentedGeometryTransforms(Autodesk.Revit.DB.Element,System.Guid)
Reset the transformation of all the augmented geometry transforms associated with a given element.
Remarks:
Use this method to reset all the transformations.
targetElement:
The target element where the transforms are attached to.
drawingServerGUID:
Geometry server GUID.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element does not have a geometry augmentation server attached.
Since:
2024

Autodesk.Revit.DB.GeometryAugmentationRegistry.SetAugmentedGeometryTransform(Autodesk.Revit.DB.Element,System.Guid,Autodesk.Revit.DB.ExternalGeometryId,Autodesk.Revit.DB.Transform)
Set the transformation of a specific augmented geometry.
Remarks:
Use this method to set the transformation.
targetElement:
The target element where the ExternalGeometryId is attached to.
drawingServerGUID:
Geometry server GUID.
externalGeometryId:
The movable ExternalGeometryId to which the the transform is associated to.
transform:
The transformation of a specific augmented geometry.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The External Geometry Id is not associated with this element.
-or-
The External Geometry Id associated with this element is not movable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
transform is a null Trf.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element does not have a geometry augmentation server attached.
Since:
2024

Autodesk.Revit.DB.GeometryAugmentationRegistry.GetAugmentedGeometryTransform(Autodesk.Revit.DB.Element,System.Guid,Autodesk.Revit.DB.ExternalGeometryId)
Get the transformation of a specific augmented geometry.
Remarks:
Use this method to get the transformation.
targetElement:
The target element where the ExternalGeometryId is attached to.
drawingServerGUID:
Geometry server GUID.
externalGeometryId:
The movable ExternalGeometryId to which the the transform is associated to.
Returns:
The transformation of a specific augmented geometry.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The External Geometry Id is not associated with this element.
-or-
The External Geometry Id associated with this element is not movable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element does not have a geometry augmentation server attached.
Since:
2024